Repository: lesbianlizard/smallsh
Catalog: po/*/smallsh-translations.po
Languages: fr

source: background pid %1$i is done: terminated by signal %2$i (%3$s)
fr: pid d'arrière-plan %1$i terminé par le signal %2$i (%3$s)

source: background pid %1$i is done: exit value %2$i
fr: pid d'arrière-plan %1$i terminé : valeur de retour %2$i

source: %1$s: waitpid error: %2$s
fr: %1$s: erreur waitpid : %2$s

source: terminated by signal %1$i (%2$s)
fr: terminé par le signal %1$i (%2$s)

source: exited with status %1$i
fr: terminé avec valeur de retour %1$i

source: %1$s: cannot kill child pid %2$i: %3$s
fr: %1$s: impossible de tuer le pid enfant %2$i: %3$s

source: Leaving foreground-only mode
fr: Fonctionnalité arrière-plan réactivée

source: Entering foreground-only mode (& is now ignored)
fr: Fonctionnalité arrière-plan désactivée (& ignorée)

source: %1$s: error: cannot change directory to '%2$s': %3$s
fr: %1$s: erreur: impossible de changer le répertoire de travail à: '%2$s': %3$s

source: %1$s: error: cannot open '%2$s' for I/O redirection: %3$s
fr: %1$s: erreur: impossible d'ouvrir '%2$s' pour la redirection E/S: %3$s

source: %1$s: fork failed: %2$s
fr: %1$s: impossible de bifurquer: %2$s

source: %1$s: command not found: '%2$s'
fr: %1$s: commande introuveable: '%2$s'

source: %1$s: cannot execute '%2$s': %3$s
fr: %1$s: impossible d'éxecuter '%2$s': %3$s

source: background pid is %1$i
fr: pid d'arrière-plan: %1$i
